OpenFOAM/WFD_OpenFOAM/cases/overnight_20260527_224229_bca724/pitch_8p0_baseline_chord/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaces ("../triSurface/overnight_20260527_224229_bca724_pitch_8p0_baseline_chord.stl");

// Identify a feature when angle between faces < includedAngle
includedAngle   150;

trimFeatures
{
    minElem         5;
}

// ************************************************************************* //
